#!/usr/bin/env python3
# -*- coding: utf-8 -*-
import math
import sys

school = {"1а": 23, "1б": 22, "2а": 21, "2б": 20, "3а": 19, "3б": 20, "4а": 18, "4б": 24, "5а": 23, "5б": 17,
          "6а": 20, "6б": 15, "7а": 18, "7б": 25, "8а": 25, "8б": 26, "9а": 29, "9б": 17, "10а": 24, "10б": 22,
          "11а": 24, "11б": 23}  # Словарь классов с количеством учащихся
 
school["2а"] = 19  # Во 2а классе изменилось количество учащихся
 
school["1в"] = 15  # В школе появился 1в класс
 
del school["10б"]  # Класс 10б был удален
 
print(f"Всего учеников в школе: {sum(school.values())}")  # Выводим на экран общее число учащихся в школе
